menu = """Главное меню:
    1. Выбрать телефонную книгу
    2. Создать новую книгу
    3  Удалить книгу
    4. Посмотреть все контакты
    5. Найти контакт
    6. Добавить контакт
    7. Изменить контакт
    8. Удалить контакт\n"""

input_choice = "Выберите пункт меню: "

wrong_choice = "Вы ввели неверное число. От 1 по 6"

no_phone_book = "Телефонная книга не выбрана"

no_contacts = "Телефонная книга пуста"

open_sucessfull = "Телефонная книга успешно открыта"

new_contact = ["Введите имя: ", "Введите телефон: ", "Введите комментарий: "]

no_phone_books = "Телефонных книг нет"

select_book = "Выберите телефонную книгу: "

select_contact = "Выберите контакт: "

input_book_name = "Введите название телефонной книги: "

input_book_comment = "Введите описание телефонной книги: "

sucessfull_create_phone_book = "Создана телефонная книга %name%"

sucessfull_delete_phone_book = "Удалениа телефонная книга %name%"

current_phone_book = "Текущая книга: %name%"

input_contact_name = "Введите имя контакта: "

input_contact_phone = "Введите телефон контакта: "

input_contact_comment = "Введите описание контакта: "