menu = """Главное меню:
    1. Выбрать телефонную книгу
    2. Создать новую книгу
    3. Изменить книгу
    4  Удалить книгу
    5. Посмотреть все контакты
    6. Найти контакт
    7. Добавить контакт
    8. Изменить контакт
    9. Удалить контакт
    10. Выгрузить книгу в файл
    11. Загрузить книгу из файла\n"""

input_choice = "Выберите пункт меню: "

wrong_choice = "Вы ввели неверное число. От 1 по 6"

no_phone_book = "Телефонная книга не выбрана"

no_contacts = "Телефонная книга пуста"

no_find_contacts = "Нет найденных контактов"

open_sucessfull = "Телефонная книга успешно открыта"

new_contact = ["Введите имя: ", "Введите телефон: ", "Введите комментарий: "]

no_phone_books = "Телефонных книг нет"

select_book = "Выберите телефонную книгу: "

select_contact = "Выберите контакт: "

input_book_name = "Введите название телефонной книги: "

input_book_comment = "Введите описание телефонной книги: "

sucessfull_create_phone_book = "Создана телефонная книга %name%"

sucessfull_delete_phone_book = "Удалениа телефонная книга %name%"

sucessfull_delete_contact = "Удален контакт %name%"

current_phone_book = "Текущая книга: %name%"

input_contact_name = "Введите имя контакта: "

input_contact_phone = "Введите телефон контакта: "

input_contact_comment = "Введите описание контакта: "

input_pattern = "Введите данные для поиска: "

input_file_path = "Введите путь к файлу: "
